In [7]:
titleType = 'movie'
titleDataset = './dataset/title.basics.tsv'
titleAkaDataset = './dataset/title.akas.tsv'

In [9]:
import pandas as pd
import numpy as np

In [155]:
titleDataFrame = pd.read_table(titleDataset)
titleDataFrame

/usr/local/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3441: DtypeWarning: Columns (4,5) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
8149918,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2010,\N,\N,"Action,Drama,Family"
8149919,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010,\N,\N,"Action,Drama,Family"
8149920,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010,\N,\N,"Action,Drama,Family"
8149921,tt9916856,short,The Wind,The Wind,0,2015,\N,27,Short
8149922,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014,\N,10,"Animation,Comedy,Family"

In [156]:
titleDataFrame.loc[1101527, 'tconst':]

tconst                                                   tt10233364
titleType                                                 tvEpisode
primaryTitle      Rolling in the Deep Dish\tRolling in the Deep ...
originalTitle                                                     0
isAdult                                                        2019
startYear                                                        \N
endYear                                                          \N
runtimeMinutes                                           Reality-TV
genres                                                          NaN
Name: 1101527, dtype: object

In [211]:
# isAdult以降のデータがずれている物があるので、手直し
titleDataFrame.loc[1101527, 'isAdult':] = [0 ,2019, '\\N', '\\N', 'Reality-TV']
titleDataFrame.at[1101527, 'originalTitle'] = titleDataFrame.at[1101527, 'primaryTitle']
titleDataFrame.loc[1522836, 'isAdult':] = [0, 2019, '\\N', '\\N', '\\N']
titleDataFrame.at[1522836, 'originalTitle'] = titleDataFrame.at[1522836, 'primaryTitle']
titleDataFrame.loc[1920329, 'isAdult':] = [0, 1981, '\\N', '\\N', 'Documentary']
titleDataFrame.at[1920329, 'originalTitle'] = titleDataFrame.at[1920329, 'primaryTitle']
titleDataFrame.loc[2034016, 'isAdult':] = [0, 2020, '\\N', '\\N', 'Talk-Show']
titleDataFrame.at[2034016, 'originalTitle'] = titleDataFrame.at[2034016, 'primaryTitle']
titleDataFrame.loc[2194165, 'isAdult':] = [0, 2020, '\\N', '\\N', 'Game-Show']
titleDataFrame.at[2194165, 'originalTitle'] = titleDataFrame.at[2194165, 'primaryTitle']
titleDataFrame.loc[2344801, 'isAdult':] = [0, 2017, '\\N', '\\N', 'Reality-TV']
titleDataFrame.at[2344801, 'originalTitle'] = titleDataFrame.at[2344801, 'primaryTitle']
titleDataFrame.loc[3079897, 'isAdult':] = [0, '\\N', '\\N', '\\N', 'Animation,Comedy,Family']
titleDataFrame.at[3079897, 'originalTitle'] = titleDataFrame.at[3079897, 'primaryTitle']
titleDataFrame.loc[5427437, 'isAdult':] = [0, 2014, '\\N', '\\N', 'Reality-TV']
titleDataFrame.at[5427437, 'originalTitle'] = titleDataFrame.at[5427437, 'primaryTitle']
titleDataFrame.loc[8105169, 'isAdult':] = [0, 2019, '\\N', '\\N', '\\N']
titleDataFrame.at[8105169, 'originalTitle'] = titleDataFrame.at[8105169, 'primaryTitle']
titleDataFrame.loc[8146263, 'isAdult':] = [0, 2005, '\\N', '\\N', '\\N']
titleDataFrame.at[8146263, 'originalTitle'] = titleDataFrame.at[8146263, 'primaryTitle']

In [198]:
titleDataFrame.loc[3079897, :]

tconst                                                   tt13704268
titleType                                                 tvEpisode
primaryTitle      Bay of the Triffids/Doctor of Doom\tBay of the...
originalTitle                                                     0
isAdult                                                          \N
startYear                                                        \N
endYear                                                          \N
runtimeMinutes                              Animation,Comedy,Family
genres                                                          NaN
Name: 3079897, dtype: object

In [210]:
titleDataFrame[titleDataFrame['tconst'] == 'tt9909210']

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8146263,tt9909210,tvEpisode,Politik und/oder Moral - Wie weit geht das Ver...,0,2005,\N,\N,\N,NaN

In [165]:
titleDataFrame.loc[1101527, 'tconst':]

tconst                                                   tt10233364
titleType                                                 tvEpisode
primaryTitle      Rolling in the Deep Dish\tRolling in the Deep ...
originalTitle     Rolling in the Deep Dish\tRolling in the Deep ...
isAdult                                                           0
startYear                                                      2019
endYear                                                          \N
runtimeMinutes                                                   \N
genres                                                   Reality-TV
Name: 1101527, dtype: object

In [ ]:
titleAkasDataFrame = pd.read_table(titleAkaDataset)
titleAkasDataFrame

In [13]:
titleDataFrame['genres']

0                 Documentary,Short
1                   Animation,Short
2          Animation,Comedy,Romance
3                   Animation,Short
4                      Comedy,Short
                     ...
8149918         Action,Drama,Family
8149919         Action,Drama,Family
8149920         Action,Drama,Family
8149921                       Short
8149922     Animation,Comedy,Family
Name: genres, Length: 8149923, dtype: object

In [24]:
# ユニークなジャンルマスタを作る
allGenreSet = set()
def split_genres(ga):
    try:
        for g in ga.split(','):
            allGenreSet.add(g)
    except:
        print(ga)
titleDataFrame['genres'].dropna(how='all').map(split_genres)
allGenreSet.remove('\\N')
allGenreSet

{'Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Family',
 'Fantasy',
 'Film-Noir',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western'}

In [26]:
import sqlite3

In [27]:
dbConnection = sqlite3.connect("movie.db")

In [40]:
for genre in allGenreSet:
    print(f"INSERT INTO genre_master(genre) VALUES ('{genre}')")
    dbConnection.execute(f"INSERT INTO genre_master(genre) VALUES ('{genre}')")

INSERT INTO genre_master(genre) VALUES ('Documentary')
INSERT INTO genre_master(genre) VALUES ('Fantasy')
INSERT INTO genre_master(genre) VALUES ('Music')
INSERT INTO genre_master(genre) VALUES ('Romance')
INSERT INTO genre_master(genre) VALUES ('Game-Show')
INSERT INTO genre_master(genre) VALUES ('Western')
INSERT INTO genre_master(genre) VALUES ('Horror')
INSERT INTO genre_master(genre) VALUES ('Reality-TV')
INSERT INTO genre_master(genre) VALUES ('Crime')
INSERT INTO genre_master(genre) VALUES ('Adventure')
INSERT INTO genre_master(genre) VALUES ('Thriller')
INSERT INTO genre_master(genre) VALUES ('Sport')
INSERT INTO genre_master(genre) VALUES ('Animation')
INSERT INTO genre_master(genre) VALUES ('Short')
INSERT INTO genre_master(genre) VALUES ('History')
INSERT INTO genre_master(genre) VALUES ('Adult')
INSERT INTO genre_master(genre) VALUES ('Talk-Show')
INSERT INTO genre_master(genre) VALUES ('Sci-Fi')
INSERT INTO genre_master(genre) VALUES ('News')
INSERT INTO genre_master(genre) VALUES ('Biography')
INSERT INTO genre_master(genre) VALUES ('Family')
INSERT INTO genre_master(genre) VALUES ('Action')
INSERT INTO genre_master(genre) VALUES ('Mystery')
INSERT INTO genre_master(genre) VALUES ('War')
INSERT INTO genre_master(genre) VALUES ('Drama')
INSERT INTO genre_master(genre) VALUES ('Film-Noir')
INSERT INTO genre_master(genre) VALUES ('Comedy')
INSERT INTO genre_master(genre) VALUES ('Musical')

In [41]:
dbConnection.commit()

In [45]:
movieTitleDataFrame = titleDataFrame[titleDataFrame['titleType'] == 'movie']
movieTitleDataFrame

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
498,tt0000502,movie,Bohemios,Bohemios,0,1905,\N,100,\N
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,\N,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,\N,90,Drama
610,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907,\N,\N,Drama
625,tt0000630,movie,Hamlet,Amleto,0,1908,\N,\N,Drama
...,...,...,...,...,...,...,...,...,...
8149812,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,0,2015,\N,57,Documentary
8149839,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007,\N,100,Documentary
8149851,tt9916706,movie,Dankyavar Danka,Dankyavar Danka,0,2013,\N,\N,Comedy
8149862,tt9916730,movie,6 Gunn,6 Gunn,0,2017,\N,116,\N
8149873,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013,\N,49,Documentary

In [224]:
def strOrNull(value):
    if value == r'\N':
        return "NULL"
    else:
        return f'"{value}"'
def intOrNull(value):
    if value == r'\N':
        return 'NULL'
    else:
        return f'{value}'
def boolOrFalse(value):
    if value == r'\N':
        return 0
    else:
        return value

In [213]:
# CREATE TABLE "title" (
# 	"tconst"	TEXT NOT NULL UNIQUE,
# 	"primaryTitle"	TEXT,
# 	"originalTitle"	TEXT,
# 	"isAdult"	INTEGER CHECK("isAdult" = 0 OR "isAdult" = 1),
# 	"startYear"	INTEGER,
# 	"endYear"	INTEGER,
# 	"runtimeMinutes"	INTEGER,
# 	"titleType"	TEXT,
# 	PRIMARY KEY("tconst")
# )

for title in titleDataFrame.itertuples():
    query = u'''INSERT INTO title(tconst, primaryTitle, originalTitle, isAdult, startYear, endYear, runtimeMinutes, titleType) VALUES(?, ?, ?, ?, ?, ?, ?, ?)'''
    values = (title.tconst, strOrNull(title.primaryTitle), strOrNull(title.originalTitle), int(title.isAdult), intOrNull(title.startYear), intOrNull(title.endYear), intOrNull(title.runtimeMinutes), strOrNull(title.titleType))
    try:
        dbConnection.execute(query, values)
    except sqlite3.IntegrityError as e:
        print(values)
        raise e

In [195]:
values

('tt13704266',
 '"Episode #5.10"',
 '"Episode #5.10"',
 0,
 '2014',
 'NULL',
 'NULL',
 '"tvEpisode"')

In [214]:
# dbConnection.rollback()
dbConnection.commit()

In [225]:
# CREATE TABLE "title_aka" (
# 	"titleId"	TEXT NOT NULL,
# 	"title"	TEXT,
# 	"region"	TEXT,
# 	"language"	TEXT,
# 	"isOriginalTitle"	INTEGER CHECK("isOriginalTitle" = 0 OR "isOriginalTitle" = 1),
# 	FOREIGN KEY("titleId") REFERENCES "title"("tconst")
# )
for title in titleAkasDataFrame.itertuples():
    query = u'''INSERT INTO title_aka(titleId, title, region, language, isOriginalTitle) VALUES(?, ?, ?, ?, ?)'''
    values = (title.titleId, strOrNull(title.title), strOrNull(title.region), strOrNull(title.language), boolOrFalse(title.isOriginalTitle))
    try:
        dbConnection.execute(query, values)
    except (*qlite3.IntegrityError, ValueError) as e:
        print(values)
        raise e

In [226]:
dbConnection.commit()

In [221]:
titleAkasDataFrame[titleAkasDataFrame['isOriginalTitle'] == '\\N']

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
86658,tt0021006,1,"Ja, der Himmel über Wien",AT,\N,\N,\N,\N
89412,tt0021453,1,Tapping Toes,US,\N,\N,\N,\N
99278,tt0023019,1,Hollywood on Parade,US,\N,\N,\N,\N
110494,tt0024677,1,Tom's in Town,US,\N,\N,\N,\N
192523,tt0036165,1,Missing Men,US,\N,\N,\N,\N
...,...,...,...,...,...,...,...,...
23339354,tt7030654,1,Black Totem,US,\N,\N,\N,\N
23411093,tt7074990,1,Nadie está mirando,ES,\N,\N,\N,\N
23636261,tt7205684,1,Вечный отпуск,RU,\N,\N,\N,\N
23700633,tt7246818,1,Yatim khaneye Iran,IR,\N,\N,\N,\N
23700634,tt7246818,2,The Orphanage,XWW,en,\N,\N,\N

In [230]:
# CREATE TABLE "title_genre" (
# 	"titleid"	TEXT NOT NULL,
# 	"genreid"	INTEGER NOT NULL,
# 	FOREIGN KEY("titleid") REFERENCES "title"("tconst"),
# 	FOREIGN KEY("genreid") REFERENCES "genre_master"("id")
# )

for title in titleDataFrame[titleDataFrame['genres'] != '\\N'].itertuples():
    for genre in title.genres.split(','):
        select = '''SELECT id FROM genre_master WHERE genre = ?'''
        select_values = (genre,)
        genre_id = dbConnection.execute(select, select_values).fetchone()[0]
        insert = '''INSERT INTO title_genre(titleId, genreid) VALUES(?, ?)'''
        insert_values = (title.tconst, genre_id)
        dbConnection.execute(insert, insert_values)

In [231]:
dbConnection.commit()